In [6]:
import pandas as pd

In [9]:
titanic_df= pd.read_csv('titanic-data.csv')

## passengers were on board the Titanic?

In [10]:
titanic_df.shape

(891, 12)

In [11]:
len(titanic_df)

891

## average age of passengers who survived vs. who didn’t?

In [12]:
titanic_df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

## Create a new column called FamilySize by adding SibSp and Parch + 1 (self).

In [14]:
titanic_df['FamilySize']= titanic_df['SibSp'] + titanic_df['Parch'] +1

In [15]:
titanic_df['FamilySize']

0      2
1      2
2      1
3      2
4      1
      ..
886    1
887    1
888    4
889    1
890    1
Name: FamilySize, Length: 891, dtype: int64

## passengers who were alone (FamilySize == 1).

In [22]:
titanic_df[titanic_df['FamilySize'] ==1] [['Name','FamilySize']]

                             Name  FamilySize
2          Heikkinen, Miss. Laina           1
4        Allen, Mr. William Henry           1
5                Moran, Mr. James           1
6         McCarthy, Mr. Timothy J           1
11       Bonnell, Miss. Elizabeth           1
..                            ...         ...
884        Sutehall, Mr. Henry Jr           1
886         Montvila, Rev. Juozas           1
887  Graham, Miss. Margaret Edith           1
889         Behr, Mr. Karl Howell           1
890           Dooley, Mr. Patrick           1

[537 rows x 2 columns]

## children (age < 12) survived vs. not survived?

In [24]:
titanic_df[titanic_df['Age'] <12].value_counts('Survived')

Survived
1    39
0    29
Name: count, dtype: int64

## the top 5 most common passenger names?

In [25]:
titanic_df['Name'].value_counts().head(5)

Name
Braund, Mr. Owen Harris                                1
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    1
Heikkinen, Miss. Laina                                 1
Futrelle, Mrs. Jacques Heath (Lily May Peel)           1
Allen, Mr. William Henry                               1
Name: count, dtype: int64

## Replace all missing ages with the median age.

In [26]:
median_age = titanic_df['Age'].median()

In [31]:
titanic_df['Age'].fillna(median_age)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

## Fill missing Embarked values with the most common port.

In [33]:
titanic_df['Embarked'].value_counts().head(4)

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [35]:
titanic_df['Embarked'].isna().sum()

np.int64(2)

In [42]:
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')

In [43]:
titanic_df['Embarked'].value_counts().head(4)

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

## Create a new column FareCategory:

In [45]:
def categorize_fare(fare):
    if fare < 10:
        return 'low'
    elif fare <= 30:
        return 'medium'
    else:
        return 'High'

In [47]:
titanic_df['FareCategory'] = titanic_df['Fare'].apply(categorize_fare)

In [49]:
titanic_df['FareCategory']

0         low
1        High
2         low
3        High
4         low
        ...
886    medium
887    medium
888    medium
889    medium
890       low
Name: FareCategory, Length: 891, dtype: object

## by using pd.cut

In [51]:


bins = [0, 10, 30, float('inf')]
labels = ['Low', 'Medium', 'High']

titanic_df['FareCategory'] = pd.cut(titanic_df['Fare'], bins=bins, labels=labels, right=False)

In [52]:
titanic_df['FareCategory']

0         Low
1        High
2         Low
3        High
4         Low
        ...
886    Medium
887      High
888    Medium
889      High
890       Low
Name: FareCategory, Length: 891, dtype: category
Categories (3, object): ['Low' < 'Medium' < 'High']

## youngest and oldest passenger for each class (Pclass).

In [53]:
#youngest
titanic_df.groupby('Pclass')['Age'].min()

Pclass
1    0.92
2    0.67
3    0.42
Name: Age, dtype: float64

In [54]:
#oldest
titanic_df.groupby('Pclass')['Age'].max()

Pclass
1    80.0
2    70.0
3    74.0
Name: Age, dtype: float64

## survival rate by gender and class.

In [58]:
titanic_df.groupby(['Sex', 'Pclass'])['Survived'].mean().unstack()

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

## List all female passengers in First Class who survived.

In [65]:
titanic_df[(titanic_df['Sex']== 'female' ) & (titanic_df['Pclass']==1) &(titanic_df['Survived']==1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,FareCategory
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,High
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,High
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,1,Medium
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,28.0,1,0,PC 17569,146.5208,B78,C,2,High
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C,2,High
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S,3,High
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S,1,Medium
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,3,High
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,2,High
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,High

## Add a new column IsMinor (True if age < 18).

In [66]:
titanic_df['IsMinor']= titanic_df['Age'] < 18

In [67]:
titanic_df['IsMinor']

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: IsMinor, Length: 891, dtype: bool

In [68]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,FareCategory,IsMinor
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,Low,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,High,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,Low,False

## Create a new column extracting the title from each name (e.g., Mr., Mrs., Miss).

In [72]:
titanic_df['Title'] = titanic_df['Name'].str.extract(r' ([A-Za-z]+)\.', expand=False)

## survival rate for each title?

In [74]:
titanic_df.groupby('Title')['Survived'].mean()

Title
Capt        0.000000
Col         0.500000
Countess    1.000000
Don         0.000000
Dr          0.428571
Jonkheer    0.000000
Lady        1.000000
Major       0.500000
Master      0.575000
Miss        0.697802
Mlle        1.000000
Mme         1.000000
Mr          0.156673
Mrs         0.792000
Ms          1.000000
Rev         0.000000
Sir         1.000000
Name: Survived, dtype: float64